app/controllers/drivers_controller.rb

	def get_driver
		@driver = Driver.find params[:id]
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

	def index
		@drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

	def create
		@driver = Driver.create!(driver_params)
---
INSERT INTO "drivers" ("name", "created_at", "updated_at", "Email", "UIN") VALUES (?, ?, ?, ?, ?)  [["name", "LiLi"], ["created_at", "2019-03-17 20:22:05.598022"], ["updated_at", "2019-03-17 20:22:05.598022"], ["Email", ""], ["UIN", "1234"]]

	def edit
		@driver = Driver.find params[:id]
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

	def update
		@driver.update_attributes!(driver_params)
---
UPDATE "drivers" SET "tel" = ?, "address" = ?, "license" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["tel", "123"], ["address", "123"], ["license", "123"], ["updated_at", "2019-03-26 19:38:59.510608"], ["id", 8]]

	def destroy
		@driver.destroy
---
DELETE FROM "drivers" WHERE "drivers"."id" = ?  [["id", 10]]