app/controllers/events_controller.rb

  def index
    @events = Event.where(start: params[:start]..params[:end])
---
SELECT "events".* FROM "events" WHERE "events"."start" BETWEEN ? AND ?  [["start", "2019-02-24 00:00:00"], ["start", "2019-04-07 00:00:00"]]

  def new
    @event = Event.new
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
    @event = Event.new(event_params)
    @event.save
---
INSERT INTO "events" ("title", "start", "end", "created_at", "updated_at", "driver_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "tt"], ["start", "2019-03-13 00:00:00"], ["end", "2019-03-13 03:00:00"], ["created_at", "2019-03-17 20:21:34.295211"], ["updated_at", "2019-03-17 20:21:34.295211"], ["driver_id", 8]]