app/controllers/onduties_controller.rb

SELECT "onduties".* FROM "onduties" WHERE "onduties"."isFinished" = ?  [["isFinished", 0]]
---
	def index
		@onduties = Onduty.where(:isFinished => false)