app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
	def index
		@requests = Request.all