app/controllers/vehicles_controller.rb

	def index
		@vehicles = Vehicle.all
---
SELECT "vehicles".* FROM "vehicles"

	def update
		@vehicle.update_attributes!(vehicle_params)
---
UPDATE "vehicles" SET "name" = ?, "updated_at" = ? WHERE "vehicles"."id" = ?  [["name", "Car2"], ["updated_at", "2019-03-26 20:09:15.383893"], ["id", 1]]

	def destroy
		@vehicle.destroy
---
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 1]]